app/controllers/api/pins_controller.rb

INSERT INTO "pins" ("title", "description", "url", "author_id", "board_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "fffff"], ["description", "hhhhh"], ["url", "fakeurl"], ["author_id", 1], ["board_id", 1], ["created_at", "2021-07-08 18:25:40.290968"], ["updated_at", "2021-07-08 18:25:40.290968"]]
---
  def create
    @pin = Pin.new(pin_params)
    if @pin.save