app/views/api/pins/index.json.jbuilder

#fetch only what belong to user
Pin.all.each do |pin|
---
SELECT "pins".* FROM "pins"